{
  "title": "A defiant move to the Norwegian Arctic",
  "link": "a-defiant-move-to-the-norwegian-arctic.html",
  "author": {
    "id": "tXeY2N",
    "name": "Warren Wong",
    "avatar": "img/user/author-85z9UC.jpg"
  },
  "category": "Travel",
  "tags": [
    "europe"
  ],
  "image": false,
  "hidden": false,
  "blocks": [
    {
      "id": "pmNKQecOWo",
      "type": "paragraph",
      "data": {
        "text": "Two female polar explorers have been living in a tiny trappers’ cabin on Svalbard in an effort to rouse a global dialogue on climate change and inspire action."
      }
    },
    {
      "id": "sFyYAuHFS1",
      "type": "paragraph",
      "data": {
        "text": "It was late July 2020 and I was in sunny Los Angeles while Sunniva Sorby and Hilde Fålun Strøm were in icy Longyearbyen, a town on the remote Norwegian archipelago of Svalbard. At 7,164km apart, this is a distance that normally entails at least a 30-hour odyssey by plane and boat, with a stopover in Oslo or Tromsø."
      }
    },
    {
      "id": "RGhUA8lE5D",
      "type": "paragraph",
      "data": {
        "text": "At this time of year, the Arctic harbour is usually clogged with cruise ships, tourists flocking like kittiwakes. But the coronavirus pandemic changed all that. Save for a few Danish and Norwegians, it was shockingly empty, the women told me."
      }
    },
    {
      "id": "6dat2NF3IB",
      "type": "quote",
      "data": {
        "text": "Because being so isolated as we are here in the Arctic at Bamsebu heightens our connection to all things. It elevates our ability to feel, listen and to understand our place in this world. Our energy is channelled into aligning our unique and powerful role in this web of life and answering the question: what can I do to give back?",
        "caption": "Sunniva Sorby, polar explorer",
        "alignment": "left"
      }
    },
    {
      "id": "teCplRH-pi",
      "type": "image",
      "data": {
        "file": {
          "url": "img/user/image-post-FK69DQ.webp"
        },
        "caption": "Image credit: Hearts in the Ice"
      }
    },
    {
      "id": "_iMTq1HcI0",
      "type": "paragraph",
      "data": {
        "text": "“I've been living here for 25 years,” Strøm told me over Zoom. “It’s supposed to be high season and we have two ships up here.”"
      }
    },
    {
      "id": "Uw-1Ky2tl7",
      "type": "paragraph",
      "data": {
        "text": "Sorby and Strøm were in Longyearbyen for a brief visit during a daunting adventure. For the previous 10 months, the two had been stuck in place, isolated like many of the rest of us. Only they’d done so with purpose and in extreme conditions – holed up in a tiny trappers’ cabin on the edge of the Arctic Ocean, 140km from Longyearbyen."
      }
    }
  ],
  "dateCreated": "December 29, 2022",
  "dateModified": "December 29, 2022",
  "timeCreated": "04:03 PM",
  "timeModified": "04:04 PM"
}