{
  "title": "Amazon’s started to deliver orders by drones in California and Texas",
  "link": "amazons-started-to-deliver-orders-by-drones-in-california.html",
  "author": {
    "id": "tXeY2N",
    "name": "Warren Wong",
    "avatar": "img/user/author-85z9UC.jpg"
  },
  "category": "Technology",
  "tags": [
    "usa"
  ],
  "image": false,
  "hidden": false,
  "blocks": [
    {
      "id": "8fZiokVbIb",
      "type": "paragraph",
      "data": {
        "text": "The retail giant already flew out some packages to customers in Northern California and a medium-sized Texan city in the run-up to Christmas."
      }
    },
    {
      "id": "mCvgjbfn9C",
      "type": "paragraph",
      "data": {
        "text": "Amazon is now delivering orders by drones in California and Texas with the aim to ultimately fly out packages to customers’ homes within an hour, Ars Technica reports."
      }
    },
    {
      "id": "q_5jt8-75l",
      "type": "paragraph",
      "data": {
        "text": "The retail giant’s drone delivery service, Amazon Prime Air, already dropped a small number of packages via drone in the backyards of customers in the run-up to Christmas in Lockeford, California, and College Station, Texas."
      }
    },
    {
      "id": "BD7Hb7fj0q",
      "type": "quote",
      "data": {
        "text": "Our aim is to safely introduce our drones to the skies. We are starting in these communities and will gradually expand deliveries to more customers over time",
        "caption": "Amazon Air spokesperson Natalie Banke",
        "alignment": "left"
      }
    },
    {
      "id": "ljn7xOC69C",
      "type": "paragraph",
      "data": {
        "text": "The Federal Aviation Administration (FAA) gave Amazon Part 135 approval to send packages by drone in 2020, as well as filing Final Environmental Assessment and Finding of No Significant Impact/Record of Decision documents for Lockeford on November 14th and College Station on December 12th."
      }
    },
    {
      "id": "XnT-0tqnQG",
      "type": "paragraph",
      "data": {
        "text": "The rural town of Lockeford, California, is located 50 miles southeast of Sacramento and has only about 3,500 residents, while College Station, Texas, is a medium-sized city 100 miles northwest of Houston that’s home to Texas A&amp;M."
      }
    },
    {
      "id": "m4GC3EOJ5f",
      "type": "paragraph",
      "data": {
        "text": "Those living in either town are eligible to sign up and place orders, while Amazon will notify customers elsewhere when drone delivery is available in their area. The most recent filings indicate Amazon’s deliveries will be available within 3.73 miles of its delivery center in Texas and within four miles of its drone depot (aka Prime Air Drone Delivery Center, or PADDC) in California."
      }
    }
  ],
  "dateCreated": "December 29, 2022",
  "dateModified": "December 29, 2022",
  "timeCreated": "04:12 PM",
  "timeModified": "09:41 PM"
}