{
  "title": "Biden and Harris celebrate Kwanzaa in social media posts",
  "link": "biden-and-harris-celebrate-kwanzaa-in-social-media.html",
  "author": {
    "id": "tXeY2N",
    "name": "Warren Wong",
    "avatar": "img/user/author-85z9UC.jpg"
  },
  "category": "Politics",
  "tags": [
    "biden",
    "usa"
  ],
  "image": false,
  "hidden": false,
  "blocks": [
    {
      "id": "W_6jpOWmvk",
      "type": "paragraph",
      "data": {
        "text": "The White House celebrated Kwanzaa in a pair of pre-recorded videos posted to Twitter on Monday, marking the seven-day non-denominational holiday aimed at honoring African Americans’ ancestral roots."
      }
    },
    {
      "id": "N3yCrIwtMx",
      "type": "paragraph",
      "data": {
        "text": "Kwanzaa is celebrated each year from December 26 to January 1, with a day dedicated to each of the Nguzo Saba, or seven principles. Celebrants light a kinara, or seven-pronged candle holder, for each principle: unity (umoja), self-determination (kujichagulia), collective responsibility (ujima), cooperative economics (ujamaa), purpose (nia), creativity (kuumba) and faith (imani)."
      }
    },
    {
      "id": "hGAWBrPaQ0",
      "type": "paragraph",
      "data": {
        "text": "In a video posted Monday, President Joe Biden and first lady Dr. Jill Biden offered thanks “for the rich heritage of African Americans, which is deep in the story of our nation.”"
      }
    },
    {
      "id": "VRwOQrJ03a",
      "type": "quote",
      "data": {
        "text": "In 2023, it’s our hope that we’ll all remember the wisdom of the seven principles of Kwanzaa, especially the values of unity and faith, as we work to make the promise of our nation real in the lives of every American",
        "caption": "President USA, Joe Biden",
        "alignment": "left"
      }
    },
    {
      "id": "TEYwEL89TJ",
      "type": "paragraph",
      "data": {
        "text": "And Vice President Kamala Harris – the nation’s first Black vice president, in addition to being the first woman to hold the role – took the opportunity to share her own experience with Kwanzaa as a child."
      }
    },
    {
      "id": "1eyPo9h8K_",
      "type": "paragraph",
      "data": {
        "text": "“Growing up, Kwanzaa was always a special time – we came together with generations of friends and family and neighbors,” Harris said. “There were never enough chairs, so my sister and I and the other children would often sit on the floor, and together we lit the candles of the kinara, and then the elders would talk about how Kwanzaa is a time to celebrate culture, community and family, and they of course taught us about the seven principles.”"
      }
    }
  ],
  "dateCreated": "December 29, 2022",
  "dateModified": "December 29, 2022",
  "timeCreated": "04:16 PM",
  "timeModified": "09:46 PM"
}