{
  "title": "Here are 3 year-end strategies for high-net-worth families to consider",
  "link": "here-are-3-year-end-strategies-for-high-net-worth-families.html",
  "author": {
    "id": "tXeY2N",
    "name": "Warren Wong",
    "avatar": "img/user/author-85z9UC.jpg"
  },
  "category": "Investing",
  "tags": [
    "finance",
    "wealth"
  ],
  "image": false,
  "hidden": false,
  "blocks": [
    {
      "id": "3z5WlMGES1",
      "type": "paragraph",
      "data": {
        "text": "This has been a year of opportunity for investors who took to heart the old Wall Street adage that “the time to buy is when there’s blood in the streets.”"
      }
    },
    {
      "id": "6f_0SrLrFx",
      "type": "paragraph",
      "data": {
        "text": "Indeed, a market drop can prove to best the best time to take advantage of various financial planning opportunities. Some of the most popular strategies this year among investors attempting to make the most of a challenging environment have included tax-loss harvesting, Roth individual retirement account conversions and buying the dip as stocks continue to plunge."
      }
    },
    {
      "id": "Z4junw4ou3",
      "type": "header",
      "data": {
        "text": "1. Use a donor-advised fund to ‘bunch’ donations",
        "level": 4
      }
    },
    {
      "id": "XsK8PS4jzO",
      "type": "paragraph",
      "data": {
        "text": "A donor-advised fund is an investment account whose purpose is supporting charitable organizations. A donor is eligible for an immediate tax deduction when contributing cash, securities, or other assets to a DAF. Those funds can then be invested for tax-free growth until the donor decides to distribute them."
      }
    },
    {
      "id": "RpxfqytXZV",
      "type": "paragraph",
      "data": {
        "text": "Grants can be made to any qualified public charity, right away or over time. A DAF is particularly useful when an investor owns a security with no cost basis, a highly appreciated stock or a long-time held concentrated position. In all these scenarios, a capital gains tax liability can be avoided by moving the position to a DAF."
      }
    },
    {
      "id": "ECte21pzn4",
      "type": "header",
      "data": {
        "text": "2. ‘Freeze’ lower value of assets for gifting purposes",
        "level": 4
      }
    },
    {
      "id": "vXJGy8I8QU",
      "type": "paragraph",
      "data": {
        "text": "For ultra-high-net-worth families, making gifts today at the depressed market prices is an opportunity to more tax efficiently shift funds out of a family’s estate. Since the gifted assets are “frozen” at today’s lower values, they use up less of the federal lifetime gift tax exemption."
      }
    },
    {
      "id": "oCSUAMw7k4",
      "type": "paragraph",
      "data": {
        "text": "The exemption is $12.06 million per person for 2022, but is set to revert to $5.49 million after 2025. At current levels, a married couple with an estate above $24.12 million, or $10.98 million after 2025, may be hit with federal estate tax."
      }
    },
    {
      "id": "E_KaO1JwLv",
      "type": "header",
      "data": {
        "text": "3. ‘Superfund’ a 529 for estate, legacy planning goals",
        "level": 4
      }
    },
    {
      "id": "xfjuF0F9AO",
      "type": "paragraph",
      "data": {
        "text": "A 529 is a tax-advantaged college savings account that may provide immediate tax savings, tax-free growth and tax-free distributions if the funds are used for qualified educational expenses. Most states require you to invest in their in-state plan to receive the deduction for contributions. However, there are several states that are considered tax parity where you can use any state’s 529 plan to receive the deduction."
      }
    },
    {
      "id": "jVHne6WxJl",
      "type": "paragraph",
      "data": {
        "text": "This is a smart way for someone to utilize tax efficiency to get money out of their estate while helping to fund a loved one’s higher education."
      }
    }
  ],
  "dateCreated": "December 29, 2022",
  "dateModified": "December 29, 2022",
  "timeCreated": "03:37 PM",
  "timeModified": "04:22 PM"
}