{
  "title": "The LastPass disclosure of leaked password vaults is being torn apart by security experts",
  "link": "the-lastpass-disclosure-of-leaked-password-vaults-is.html",
  "author": {
    "id": "tXeY2N",
    "name": "Warren Wong",
    "avatar": "img/user/author-85z9UC.jpg",
    "bio": "Growing up in Chicago, where he discovered his love of writing, he thought that words might open doors to freedom & spark the imagination.",
    "socialMedia": [
      {
        "facebook": "#some-link"
      },
      {
        "twitter": "#some-link"
      },
      {
        "instagram": false
      },
      {
        "linkedin": "#some-link"
      },
      {
        "website": "#some-link"
      }
    ]
  },
  "category": "Technology",
  "tags": [
    "security"
  ],
  "image": false,
  "biography": true,
  "comments": true,
  "hidden": false,
  "blocks": [
    {
      "id": "t3Vi-FL1Nt",
      "type": "paragraph",
      "data": {
        "text": "Last week, just before Christmas, LastPass dropped a bombshell announcement: as the result of a breach in August, which lead to another breach in November, hackers had gotten their hands on users’ password vaults. While the company insists that your login information is still secure, some cybersecurity experts are heavily criticizing its post, saying that it could make people feel more secure than they actually are and pointing out that this is just the latest in a series of incidents that make it hard to trust the password manager."
      }
    },
    {
      "id": "XaTcPPQ7w3",
      "type": "paragraph",
      "data": {
        "text": "LastPass’ December 22nd statement was “full of omissions, half-truths and outright lies,” reads a blog post from Wladimir Palant, a security researcher known for helping originally develop AdBlock Pro, among other things. Some of his criticisms deal with how the company has framed the incident and how transparent it’s being; he accuses the company of trying to portray the August incident where LastPass says “some source code and technical information were stolen” as a separate breach when he says that in reality the company “failed to contain” the breach."
      }
    },
    {
      "id": "z2_TknzxvZ",
      "type": "quote",
      "data": {
        "text": "LastPass’s claim of ‘zero knowledge’ is a bald-faced lie.",
        "caption": "",
        "alignment": "left"
      }
    },
    {
      "id": "Sb9kyRyec9",
      "type": "paragraph",
      "data": {
        "text": "He also highlights LastPass’ admission that the leaked data included “the IP addresses from which customers were accessing the LastPass service,” saying that could let the threat actor “create a complete movement profile” of customers if LastPass was logging every IP address you used with its service."
      }
    },
    {
      "id": "uArY1mcVLB",
      "type": "paragraph",
      "data": {
        "text": "Another security researcher, Jeremi Gosney, wrote a long post on Mastodon explaining his recommendation to move to another password manager. “LastPass’s claim of ‘zero knowledge’ is a bald-faced lie,” he says, alleging that the company has “about as much knowledge as a password manager can possibly get away with.”"
      }
    },
    {
      "id": "_A842ge9zK",
      "type": "paragraph",
      "data": {
        "text": "LastPass claims its “zero knowledge” architecture keeps users safe because the company never has access to your master password, which is the thing that hackers would need to unlock the stolen vaults."
      }
    }
  ],
  "dateCreated": "December 29, 2022",
  "dateModified": "July 05, 2023",
  "timeCreated": "03:29 PM",
  "timeModified": "02:03 PM"
}