{
  "title": "The typical U.S. household is spending $445 more a month due to inflation",
  "link": "the-typical-us-household-is-spending-445-more-a.html",
  "author": {
    "id": "tXeY2N",
    "name": "Warren Wong",
    "avatar": "img/user/author-85z9UC.jpg"
  },
  "category": "Investing",
  "tags": [
    "inflation",
    "usa"
  ],
  "image": "img/user/image-featured-a4DfvV.jpg",
  "hidden": false,
  "blocks": [
    {
      "id": "valyH0N5F5",
      "type": "paragraph",
      "data": {
        "text": "Inflation is causing American households to spend $445 more per month buying the same items they did a year ago, according to an estimate from Moody’s Analytics."
      }
    },
    {
      "id": "dQJJw5C7dw",
      "type": "paragraph",
      "data": {
        "text": "Consumer prices jumped by 8.2% in September versus the same month in 2021, the U.S. Bureau of Labor Statistics said Thursday. That rate is down from 9.1% in June, which marked the recent peak, but is still near the highest levels since the early 1980s."
      }
    },
    {
      "id": "43NgHQ2h6_",
      "type": "paragraph",
      "data": {
        "text": "Wages for many workers haven’t kept pace with inflation, meaning they’ve lost purchasing power. Hourly earnings fell 3%, on average, in the year to September after accounting for inflation, according to the bureau."
      }
    },
    {
      "id": "XDaz2mV5sF",
      "type": "paragraph",
      "data": {
        "text": "The inflation impact on households’ wallets isn’t uniform, though. Your personal inflation rate depends on the types of goods and services you buy, and other factors such as geography."
      }
    },
    {
      "id": "JlQmxOchNy",
      "type": "header",
      "data": {
        "text": "There’s ‘no one silver bullet’ to save money",
        "level": 4
      }
    },
    {
      "id": "E772iq5w-S",
      "type": "paragraph",
      "data": {
        "text": "Households can take certain steps to blunt the impact — and most are unlikely to feel good, according to financial advisors."
      }
    },
    {
      "id": "1-6cWbnz_p",
      "type": "paragraph",
      "data": {
        "text": "“There’s no one silver bullet,” said Joseph Bert, a certified financial planner who serves as chairman and CEO of Certified Financial Group. The firm, based in Altamonte Springs, Florida, ranked No. 95 on the 2022 CNBC Financial Advisor 100 list."
      }
    },
    {
      "id": "Iv9U3hREQd",
      "type": "paragraph",
      "data": {
        "text": "Fixed expenses are outlays for essentials such as a mortgage, rent, food, transit costs and insurance, for example. Discretionary costs include spending on, say, dining out or vacations — things people enjoy but don’t necessarily need."
      }
    },
    {
      "id": "lQrP08jH6w",
      "type": "paragraph",
      "data": {
        "text": "There’s often less flexibility to cut fixed expenses, meaning nonessentials are the budget area where households likely have to make cuts if they want to save money, Maloon said."
      }
    }
  ],
  "dateCreated": "December 29, 2022",
  "dateModified": "January 04, 2023",
  "timeCreated": "04:19 PM",
  "timeModified": "10:20 PM"
}