{
  "title": "Turf houses: Iceland's original 'green' buildings",
  "link": "turf-houses-icelands-original-green-buildings.html",
  "author": {
    "id": "tXeY2N",
    "name": "Warren Wong",
    "avatar": "img/user/author-85z9UC.jpg",
    "bio": "Growing up in Chicago, where he discovered his love of writing, he thought that words might open doors to freedom & spark the imagination.",
    "socialMedia": [
      {
        "facebook": "#some-link"
      },
      {
        "twitter": "#some-link"
      },
      {
        "instagram": false
      },
      {
        "linkedin": "#some-link"
      },
      {
        "website": "#some-link"
      }
    ]
  },
  "category": "Travel",
  "tags": [
    "europe"
  ],
  "image": false,
  "biography": true,
  "comments": true,
  "hidden": false,
  "blocks": [
    {
      "id": "Ll6d3NuYNg",
      "type": "paragraph",
      "data": {
        "text": "Known as \"torfbæir\", these ingeniously designed homes helped settle one of Europe's least-hospitable environments."
      }
    },
    {
      "id": "U5NW1Ez-A0",
      "type": "paragraph",
      "data": {
        "text": "With its lonely lava fields, sheer bluffs and stark boulder-strewn plains, Iceland is one of Europe's most barren countries. Across much of the island, the utter remoteness is striking, and that's especially true in the far-flung Northwestern Region, where I had come to learn about how Icelanders were able to settle one of the least hospitable and most volcanically active places on Earth."
      }
    },
    {
      "id": "uBxLJZ9YwL",
      "type": "paragraph",
      "data": {
        "text": "Settling Iceland, even for the hardened Norse, was tough back in the 9th Century CE. There were sub-zero temperatures and thick snow cover even on lower-lying ground throughout much of the year. The predominantly rocky nation never yielded the fecund land other European nations did: just one-fifth of it, mostly in the Northwestern Region, is cultivatable to this day. When Norse sailors first spotted the island, Iceland was roughly 30% forested, a low coverage compared to elsewhere in Scandinavia at the time. With limited timber, materials for building houses were hard to come by, especially since the island's basalt rocks were difficult to hew.&nbsp;"
      }
    },
    {
      "id": "io5Nj4oyXk",
      "type": "image",
      "data": {
        "file": {
          "url": "img/user/image-post-JFq8ur.webp"
        },
        "caption": "The ingenious design of turf houses helped Nordic settlers survive in Iceland"
      }
    },
    {
      "id": "zmsSdGb3kW",
      "type": "paragraph",
      "data": {
        "text": "All things considered, it's surprising Iceland's settlers even survived. That they did can be attributed to one factor above others: torfbæir (turf houses), which were used for shelter since the days of the first Nordic settlers until the late 20th Century. These dwellings were built around basic timber frames, with blocks cut out of turf (grass and the soil up to 1m thick) arranged over a base layer of rock and packed in to form the structure's walls and roofs. Today, they can still be found across the country, sticking out of the landscape grass-side up like tussocky tents. There are especially good examples open to the public at Glaumbær in the north-west, Laufás in the north and Keldur in the south."
      }
    },
    {
      "id": "uMD4K8vKCJ",
      "type": "quote",
      "data": {
        "text": "The importance of Icelandic turf houses goes beyond turf – it is also aesthetics, as part of the national heritage",
        "caption": "Hjörleifur Stefánsson, an Icelandic architect",
        "alignment": "left"
      }
    },
    {
      "id": "QDWsbOGc4k",
      "type": "paragraph",
      "data": {
        "text": "Around the beginning of the 20th Century, philanthropists intervened, bemoaning the impracticality and unsavoury living conditions of turf houses. Timber, stone and then concrete, which were more readily available from the mid-19th Century onwards as overseas trade increased, became more commonly used for construction.&nbsp;"
      }
    }
  ],
  "dateCreated": "December 29, 2022",
  "dateModified": "July 05, 2023",
  "timeCreated": "03:21 PM",
  "timeModified": "02:02 PM"
}